[
  {
    "image": "https://i.ibb.co.com/FbRcnQgW/app-sotre.png",
    "title": "Apple App Store",
    "companyName": "Apple Inc.",
    "id": 1,
    "description": "The Apple App Store is the curated, secure marketplace for iPhone, iPad and iPod touch users, offering millions of apps across categories including games, productivity, education, health, entertainment and utilities. It provides curated editorial content, personalized recommendations, app charts, charts by category and regional highlights. Developers distribute updates, in-app purchases and subscriptions through a standardized platform with privacy labels and review processes, while users enjoy integrated payment methods, family sharing, ratings, and regular feature drops. The store emphasizes security, quality and discoverability to help users find apps that suit personal and professional needs.",
    "size": 90,
    "reviews": 12500000,
    "ratingAvg": 4.7,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 9000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zVLxtRJx/playstore.png",
    "title": "Play Store",
    "companyName": "Google LLC",
    "id": 2,
    "description": "Google Play Store is the comprehensive app and digital-content marketplace for Android devices, offering apps, games, movies, TV shows, books and audiobooks. It combines algorithmic recommendations, human-curated collections, editorial stories and user reviews to surface relevant content. Play Protect scans apps for malware, and developers can publish updates, beta builds and staged rollouts. The platform supports in-app purchases, subscriptions, family sharing and localized storefronts across regions while enabling developers to reach billions of Android devices with analytics and monetization tools.",
    "size": 85,
    "reviews": 22000000,
    "ratingAvg": 4.6,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 350000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 4500000 },
      { "name": "5 star", "count": 16000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/jZ10rJky/insta.png",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "Instagram is a visual-first social platform focused on photo and short-video sharing, creative expression and community engagement. Users post photos, Stories and Reels, follow creators, interact through likes, comments and DMs, and discover content via Explore and topic channels. The app provides integrated editing tools, filters, music, AR effects and creator monetization features such as badges and shopping. Businesses use Instagram for branded content, targeted ads, analytics and storefronts, turning the app into a mix of social networking, entertainment and commerce for a global user base.",
    "size": 70,
    "reviews": 95000000,
    "ratingAvg": 4.4,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 23000000 },
      { "name": "5 star", "count": 59000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDxD2w34/facebook.png",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 4,
    "description": "Facebook is a social networking platform enabling users to connect with friends, family and communities by sharing text updates, photos, videos and links. It offers groups, pages, events, Marketplace, and Watch for longer video content. The app supports targeted advertising, business pages, and creator monetization; administrators can manage community moderation, insights and promotions. Facebook emphasizes staying connected, discovering local happenings, and building social graphs, while continually adding features for audio, video, shopping and integrations across the company ecosystem.",
    "size": 120,
    "reviews": 120000000,
    "ratingAvg": 4.2,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 10000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 12000000 },
      { "name": "4 star", "count": 30000000 },
      { "name": "5 star", "count": 62000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/W43YDmVM/twitter.png",
    "title": "Twitter (X)",
    "companyName": "X Corp.",
    "id": 5,
    "description": "Twitter, now referred to as X in branding, is a microblogging and real-time discussion platform used for breaking news, public conversation and short-form posts. Users tweet text, images, videos and links, follow topics and accounts, join Spaces for live audio discussion, and curate lists. The platform is used by journalists, public figures and communities to share updates instantly. X integrates trending topics, algorithmic and chronological timelines, verification and premium features aimed at improving content discovery and user interaction.",
    "size": 65,
    "reviews": 48000000,
    "ratingAvg": 4.1,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 14000000 },
      { "name": "5 star", "count": 20000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/27k3Xxhm/viber.png",
    "title": "Viber",
    "companyName": "Rakuten Viber",
    "id": 6,
    "description": "Viber is a cross-platform messaging and calling app offering free text messaging, HD-quality voice and video calls, group chats, stickers and media sharing. Designed for international calling, it also provides Viber Out for calling non-users at low rates. Viber supports public chats and communities for topic-based discussions and offers encryption for private conversations. The app focuses on simplicity, multimedia-rich interaction and tools for small businesses to communicate with customers through chat features and promotional messaging.",
    "size": 80,
    "reviews": 9200000,
    "ratingAvg": 4.5,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 5800000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/WvK87MLP/whatsapp.png",
    "title": "WhatsApp",
    "companyName": "Meta Platforms, Inc.",
    "id": 7,
    "description": "WhatsApp is a widely used messaging platform that provides encrypted texting, voice and video calling, group chats, file sharing and status updates. Built for fast, reliable messaging across mobile networks and Wi-Fi, WhatsApp supports end-to-end encryption for private conversations and offers WhatsApp Business for enterprises to manage customer communication, catalogs and automated replies. The app focuses on privacy, simplicity and cross-platform reliability while adding features like payments and voice note improvements depending on region and regulation.",
    "size": 55,
    "reviews": 168000000,
    "ratingAvg": 4.7,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 7000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 125000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DfQ1vW8k/imo.png",
    "title": "imo",
    "companyName": "imo.im",
    "id": 8,
    "description": "imo is a lightweight messaging and video calling app tailored for users seeking low-data, straightforward communication. It supports video and voice calls, text messages, media sharing and group chats. The app is optimized for reliability in regions with limited bandwidth and offers stickers, status updates and cross-platform access from mobile and desktop. imo’s simple UI and focus on core communication features make it a practical choice for quick stays-in-touch and international calling without complex setup.",
    "size": 60,
    "reviews": 6500000,
    "ratingAvg": 4.3,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 3450000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/r24J81QX/gallery.png",
    "title": "Gallery",
    "companyName": "Samsung Electronics",
    "id": 9,
    "description": "Gallery is a native photo and video management app that helps users view, organize and edit visual media on their devices. It provides album organization, automatic sorting by date and location, favorites, and basic editing tools such as crop, rotate, filters and exposure adjustments. Cloud backup integration allows photos and videos to be safely stored and synced across devices. The app emphasizes quick sharing, straightforward file management and accessibility for users who want a simple, reliable gallery experience.",
    "size": 40,
    "reviews": 5200000,
    "ratingAvg": 4.5,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1300000 },
      { "name": "5 star", "count": 3150000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/7xYhQ4qG/youtube.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 10,
    "description": "YouTube is the world’s largest video platform where users watch, upload and interact with billions of videos spanning music, education, news, entertainment and creator content. The service offers channels, subscriptions, playlists, live streaming, short-form Shorts, and monetization options for creators. Viewers receive personalized recommendations, playlists and offline downloads through Premium. With powerful analytics and content moderation tools, YouTube supports both casual viewers and professional creators, enabling community engagement through comments, stories and community posts.",
    "size": 95,
    "reviews": 155000000,
    "ratingAvg": 4.6,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": 8000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": 9000000 },
      { "name": "4 star", "count": 35000000 },
      { "name": "5 star", "count": 105000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/HTqdgvCY/linkedin.png",
    "title": "LinkedIn",
    "companyName": "Microsoft Corporation",
    "id": 11,
    "description": "LinkedIn is the professional networking platform designed for career development, recruiting and professional content. Users create profiles showcasing experience, skills and portfolios, connect with colleagues, search jobs and follow companies. The platform offers LinkedIn Learning for skill-building, recruiter tools for talent sourcing, and posting features for articles, job listings and company updates. LinkedIn emphasizes trusted professional interactions, thought leadership distribution and tools to help individuals and businesses grow their professional presence online.",
    "size": 90,
    "reviews": 15000000,
    "ratingAvg": 4.3,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 10100000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Jwx1kKyb/tik-tok.png",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 12,
    "description": "TikTok is a short-form video platform where creators produce bite-sized clips that entertain, educate and inspire. The app promotes content discovery via a powerful recommendation algorithm that surfaces trending audio, challenges, duets and creative effects. It supports editing tools, AR filters, music licensing, and in-app commerce features. Brands and creators use TikTok for viral marketing, influencer partnerships and community building; its emphasis on creativity and rapid trends has made it a central hub for modern social media culture.",
    "size": 150,
    "reviews": 98000000,
    "ratingAvg": 4.4,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 7000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 22000000 },
      { "name": "5 star", "count": 57000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/wrrZsD6M/telegram.png",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 13,
    "description": "Telegram is a cloud-based messaging platform focused on speed, security and large-group communication. It supports private chats with end-to-end encryption in secret chats, massive group chats, channels for broadcast messaging, file sharing up to large sizes, bots for automation and customizations, and multi-device sync. Telegram has a developer-friendly API and emphasizes privacy-respecting features, custom themes and sticker ecosystems, appealing to communities, publishers and users who want flexible, feature-rich messaging beyond standard SMS.",
    "size": 80,
    "reviews": 21000000,
    "ratingAvg": 4.5,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 900000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 15000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/HLTYQpGh/snapchat.png",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 14,
    "description": "Snapchat is a multimedia messaging app centered on ephemeral content and playful AR experiences. Users send disappearing Snaps, post Stories, create Bitmojis and explore augmented reality lenses. The platform offers Spotlight for short viral videos, Discover for curated publisher content, and tools for creators and advertisers. Snapchat’s emphasis on immediacy, camera-first interaction and interactive AR features makes it popular among younger audiences for casual social sharing and interactive marketing campaigns.",
    "size": 95,
    "reviews": 45000000,
    "ratingAvg": 4.2,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 11000000 },
      { "name": "5 star", "count": 21000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Csvvbkpd/crunchyrol.png",
    "title": "Crunchyroll",
    "companyName": "Crunchyroll, LLC",
    "id": 15,
    "description": "Crunchyroll is a streaming service dedicated to anime and East Asian content, offering simulcasts, full seasons and movies. It provides a catalog of licensed series with subtitles and dubs, curated collections, news and community features for anime fans. Users can browse by genre, follow simulcast schedules, and access premium ad-free viewing, offline downloads and higher-quality streams. Crunchyroll supports both casual viewers and hardcore fans with forums, merch drops and events tied to the anime community.",
    "size": 70,
    "reviews": 8500000,
    "ratingAvg": 4.6,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 5850000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/KpmTsTY2/discord.png",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 16,
    "description": "Discord is a voice, video and text chat platform built for communities, gamers and interest groups. It offers persistent servers with text channels, voice channels, threads, stage channels for live audio, screen sharing and video calls, plus bot integrations for moderation and automation. Discord supports roles and granular permissions, community discovery, Nitro subscription perks and developer tools. Its flexible structure makes it suitable for casual friend groups, hobbyist communities and professional teams seeking centralized communication.",
    "size": 120,
    "reviews": 35000000,
    "ratingAvg": 4.6,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 25800000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Rkpp3pBS/chrome.png",
    "title": "Chrome",
    "companyName": "Google LLC",
    "id": 17,
    "description": "Google Chrome is a fast, secure, and widely used web browser that syncs bookmarks, history and settings across devices via a Google account. It offers tabbed browsing, extensions from the Chrome Web Store, built-in translation and password management, and frequent security updates. Chrome focuses on speed and compatibility with modern web standards, while features like profiles, Incognito mode and developer tools make it suitable for both everyday browsing and advanced web development workflows.",
    "size": 110,
    "reviews": 98000000,
    "ratingAvg": 4.5,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": 6000000 },
      { "name": "2 star", "count": 3500000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 55500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dstnH6R0/messenger.png",
    "title": "Messenger",
    "companyName": "Meta Platforms, Inc.",
    "id": 18,
    "description": "Messenger is a messaging app that enables text, voice and video conversations with Facebook friends and contacts. It supports group chats, reactions, stickers, voice messages, and end-to-end encryption for Secret Conversations. Messenger integrates games, bots, payments (in supported regions) and business messaging for customer interactions. Cross-app functionality with other Meta services enhances social connectivity, while features like polls, watch together, and shared media streamline collaborative and social experiences.",
    "size": 90,
    "reviews": 70000000,
    "ratingAvg": 4.3,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 6000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 18000000 },
      { "name": "5 star", "count": 35000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/bjkxc4tf/uber.png",
    "title": "Uber",
    "companyName": "Uber Technologies Inc.",
    "id": 19,
    "description": "Uber is a mobility and delivery platform connecting riders with driver-partners, and consumers with food, grocery and parcel delivery options through separate services. The app allows users to request rides, view driver ETA, track trips in real time and pay via in-app methods. For deliveries, Uber integrates menus, real-time order tracking and driver ratings. The platform supports driver tools, fare estimates and safety features, and operates globally with localized services and partnerships for last-mile logistics.",
    "size": 75,
    "reviews": 45000000,
    "ratingAvg": 4.4,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 2500000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 11000000 },
      { "name": "5 star", "count": 22500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ycrwF0dh/google-photos.png",
    "title": "Google Photos",
    "companyName": "Google LLC",
    "id": 20,
    "description": "Google Photos is a photo and video storage, organization and editing service that uses cloud backup and machine learning to help users find memories quickly. It provides automatic backup, smart albums, searchable objects and faces, basic and advanced editing tools, automatic creations and cinematic effects. With cross-device sync, offline access and sharing options, Google Photos streamlines photo management for individuals and families while offering paid storage tiers and intelligent search capabilities powered by Google’s AI.",
    "size": 95,
    "reviews": 72000000,
    "ratingAvg": 4.7,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 13000000 },
      { "name": "5 star", "count": 50500000 }
    ]
  }
]
